# 家庭作业
title = '自我介绍'
name = "谢忠沂"  # 字符串
age = 18  # 整形
money = 15.0  # 浮点型
country = '中国'  # 字符串
print(title)
print('我的名字叫做:', name)
print('出生于：', country)
print('今年的年龄是（岁）：', age)
print('每天的生活费大概有(元):', money)


# 所学内容
# 1）变量组成：变量名、内存地址、存储的数据值
# 2）python变量赋值的理解：
# 例a=1,及创建一个新地址该地址存储的值为1，当a=2时，并不是将此地址的值进行覆盖而是
# 重新创建一个新的地址存放，与c语言的赋值不同，与指针类似
# 3）变量的书写要求：1.由下划线、数字、字母组成2.数字不能作为开头3.不能用关键字命名4.区分大小写
# 4）变量的书写规范：下划线，大小驼峰法
# 5)函数学习：type（）：查询变量存储值的数据类型；id()查询变量的内存地址
# 6）常量：约定俗称为全是大写字母的变量，不可更改，如PI=3.14

